# YOLOv8 Optimized for VisDrone Aerial Detection
# This configuration is specifically designed for aerial object detection challenges:
# - Small objects at various scales
# - Multi-scale feature extraction
# - Efficient attention mechanisms
# - Reduced computational overhead

# Parameters
nc: 12  # VisDrone has 12 classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # For yolov8n-visdrone
  s: [0.33, 0.50, 1024]  # For yolov8s-visdrone
  m: [0.67, 0.75, 768]   # For yolov8m-visdrone
  l: [1.00, 1.00, 512]   # For yolov8l-visdrone
  x: [1.00, 1.25, 512]   # For yolov8x-visdrone

# YOLOv8 backbone optimized for aerial detection
backbone:
  # from, number, module, args
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 3, EnhancedC2f, [128, True]]   # 2, enhanced for small objects
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 6, EnhancedC2f, [256, True]]   # 4, multi-scale features
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 6, EnhancedC2f, [512, True]]   # 6, enhanced attention
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 3, EnhancedC2f, [1024, True]]  # 8, high-level features
  - [-1, 1, SPPF, [1024, 5]]            # 9

# YOLOv8 head with enhanced features for aerial detection
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 3, EnhancedC2f, [512]]         # 12, enhanced fusion

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 3, EnhancedC2f, [256]]         # 15, small object enhancement

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 3, EnhancedC2f, [512]]         # 18, medium object enhancement

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat head P5
  - [-1, 3, EnhancedC2f, [1024]]        # 21, large object enhancement

  - [[15, 18, 21], 1, Detect, [nc]]      # Detect(P3, P4, P5) for VisDrone classes