# YOLOv8 Optimized Lite for VisDrone - Based on Best Performing Pattern
# Uses selective enhancement strategy that proved successful

# Parameters
nc: 12  # VisDrone classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]

# Optimized backbone - selective enhancement
backbone:
  # from, number, module, args
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C2f, [128, True]]           # 2, standard for speed
  - [-1, 1, Conv, [256, 3, 2]]          # 3-P3/8
  - [-1, 3, LightAttn, [256, True, 1, 0.5, 0.3]]   # 4, lightweight attention
  - [-1, 1, Conv, [512, 3, 2]]          # 5-P4/16
  - [-1, 3, LightAttn, [512, True, 1, 0.5, 0.3]]   # 6, lightweight attention
  - [-1, 1, Conv, [1024, 3, 2]]         # 7-P5/32
  - [-1, 2, C2f, [1024, True]]          # 8, standard for high level
  - [-1, 1, SPPF, [1024, 5]]            # 9

# Head with selective enhancement
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 2, LightAttn, [512, False, 1, 0.5, 0.3]]   # 12, enhanced fusion

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 2, LightAttn, [256, False, 1, 0.5, 0.3]]   # 15, enhanced for small objects

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 2, C2f, [512]]                 # 18, standard

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat head P5
  - [-1, 2, C2f, [1024]]                # 21, standard

  - [[15, 18, 21], 1, Detect, [nc]]      # Detect for VisDrone